package com.crypto.blockfolio.persistence.entity;

/**
 * Перелічення шаблонів помилок, що використовуються для перевірки даних. Дозволяє стандартизувати
 * повідомлення про помилки у системі.
 */
public enum ErrorTemplates {

    /**
     * Шаблон для обов'язкового заповнення поля
     */
    REQUIRED("Поле %s є обов'язковим до заповнення."),
    /**
     * Шаблон для мінімальної довжини поля.
     */
    MIN_LENGTH("Поле %s не може бути меншим за %d симв."),
    /**
     * Шаблон для максимальної довжини поля.
     */
    MAX_LENGTH("Поле %s не може бути більшим за %d симв."),
    /**
     * Шаблон для перевірки використання лише латинських символів.
     */
    ONLY_LATIN("Поле %s має містити лише латинські символи та символ _."),
    /**
     * Шаблон для перевірки паролю.
     */
    PASSWORD(
        "Поле %s має містити латинські символи, де принаймні одна буква з великої та малої, і одна цифра.");

    /**
     * Текст шаблону помилки.
     */
    private final String template;

    /**
     * Конструктор для створення елемента переліку шаблонів помилок.
     *
     * @param template текст шаблону.
     */
    ErrorTemplates(String template) {
        this.template = template;
    }
    
    /**
     * Повертає текст шаблону помилки.
     *
     * @return текст шаблону.
     */
    public String getTemplate() {
        return template;
    }
}
